#include <iostream>
#include <iomanip>

using namespace std;

int main()
{
	long f1, f2;
	int i;
	f1 = f2 = 1;
	for (i = 1; i <= 20; i++)
	{
		cout << setw(12) << f1 << setw(12) << f2; //设备输出字段宽度为12,每次输出两个数
		if (i % 2 == 0)
			cout << endl; //每输出完4个数后换行,使每行输出4个数
		f1 = f1 + f2; //左边的f1代表第3个数,是第1,2两个数之和,
		f2 = f2 + f1; //左边的f2代表第4个数,是第2,3两个数之和
	}
	return 0;
}

/*
		   1           1           2           3
           5           8          13          21
          34          55          89         144
         233         377         610         987
        1597        2584        4181        6765
       10946       17711       28657       46368
       75025      121393      196418      317811
      514229      832040     1346269     2178309
     3524578     5702887     9227465    14930352
    24157817    39088169    63245986   102334155
*/
